app/controllers/pages_controller.rb

  def index
  	if session[:id] !=nil
 	@user = User.find(session[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]