app/controllers/users_controller.rb

INSERT INTO "users" ("firstname", "lastname", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["firstname", "asdaf"], ["lastname", "asdfsadf"], ["email", "asdfsafds"], ["password", "123"], ["created_at", "2017-09-22 08:36:04.824114"], ["updated_at", "2017-09-22 08:36:04.824114"]]
---
	def create
		@user = User.new(user_params)
		if @user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "mivon@mivon.com"], ["password", "lacyman"], ["LIMIT", 1]]
---
	def loginresult
		pp @user = User.find_by_email_and_password(params[:users][:email],params[:users][:password])

UPDATE "users" SET "firstname" = ?, "lastname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["firstname", "tester1"], ["lastname", "tester2"], ["updated_at", "2017-09-29 11:46:58.484123"], ["id", 8]]
---
def update
	@user.update(user_params)